-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Хост: MySql-8.4
-- Время создания: Авг 23 2025 г., 16:40
-- Версия сервера: 8.4.4
-- Версия PHP: 8.4.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cabinet`
--

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` bigint UNSIGNED NOT NULL,
  `is_admin` tinyint(1) NOT NULL COMMENT 'яваляется ли администратором',
  `login` varchar(50) NOT NULL,
  `email` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Электронная почта',
  `pass` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `is_hashed` tinyint(1) NOT NULL COMMENT 'Зашифрован ли пароль',
  `name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'ФИО пользователя',
  `inn` varchar(12) DEFAULT NULL COMMENT 'ИНН (ФЛ=12, ЮЛ=10)',
  `kpp` varchar(9) DEFAULT NULL COMMENT 'КПП организации (ЮЛ)',
  `director_name` varchar(50) NOT NULL COMMENT 'Имя директора (ЮЛ)',
  `birthday` date DEFAULT NULL COMMENT 'День рождения (ФЛ,ИП)',
  `document_details` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Реквизиты документа (ФЛ,ИП)',
  `ogrn` varchar(13) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'ОГРН (ЮЛ)',
  `ogrnip` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'ОГРНИП (ИП)',
  `address` varchar(255) NOT NULL COMMENT 'Адрес регистрации',
  `dog_num` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Номер договора',
  `dog_beg_date` date NOT NULL COMMENT 'Дата договора начало',
  `dog_end_date` date NOT NULL COMMENT 'Дата договора конец',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Телефон',
  `tax_form` varchar(50) NOT NULL COMMENT 'Форма налогообложения ',
  `bank_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'Имя банка',
  `bank_inn` varchar(10) NOT NULL COMMENT 'ИНН банка',
  `bank_bik` varchar(9) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'БИК',
  `bank_ks` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'к/с',
  `bank_rs` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT 'р/с',
  `bank_verified` tinyint(1) NOT NULL COMMENT 'Банк есть в списках',
  `commission_percentage` int UNSIGNED NOT NULL COMMENT 'Комиссия, %',
  `status` int NOT NULL COMMENT '0-подана заявка, 1-разрешенние админом, 2- заблокирован админом.',
  `is_archived` tinyint(1) NOT NULL COMMENT 'в архиве',
  `archived_date` date DEFAULT NULL,
  `agent_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'Статус партнера \r\n0-не определен\r\n1-Физическое лицо\r\n2-Индивидуальный предприниматель\r\n3-Юридическое лицо',
  `privacy_consent` tinyint(1) DEFAULT '0' COMMENT 'Согласие на обработку персональных данных',
  `privacy_consent_date` datetime DEFAULT CURRENT_TIMESTAMP COMMENT 'Дата время согласие на обработку персональных данных',
  `pass_tmp` varchar(50) NOT NULL COMMENT 'Временный пароль на этапе разработки'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='Таблица пользователей (партнеров и администраторов)';

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `is_admin`, `login`, `email`, `pass`, `is_hashed`, `name`, `inn`, `kpp`, `director_name`, `birthday`, `document_details`, `ogrn`, `ogrnip`, `address`, `dog_num`, `dog_beg_date`, `dog_end_date`, `phone`, `tax_form`, `bank_name`, `bank_inn`, `bank_bik`, `bank_ks`, `bank_rs`, `bank_verified`, `commission_percentage`, `status`, `is_archived`, `archived_date`, `agent_status`, `privacy_consent`, `privacy_consent_date`, `pass_tmp`) VALUES
(1, 1, 'Admin', 'admin@gmail.com', '$2y$12$BRwh8.XikEjLEniB5i/TVuFPJ8wOzRF8RHm/DAhyoVduiIdH3gAcq', 1, 'Королева Алевтина Ивановна', '771234567890', NULL, '', '1975-03-15', 'паспорт РФ, 4510 123456, выдан ОУФМС России по г. Москве, 15.03.2015, код подразделения 770-001', '', '', '125009, г. Москва, ул. Тверская, д. 15, кв. 42', '123/456', '2025-01-01', '2025-12-31', '+7(927)785-22-55', '', 'АКБ «Абсолют Банк» (ПАО)', '7729013549', '044525976', '30101810500000000976', '40817810099910004312', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:40', 'Admin123'),
(2, 0, 'User', 'user@gmail.com', '$2y$12$cG7pSGtxPg7FPE8TG6U9pOj8fXNj7QdEBhmUkHAIVFJ5mEQK0LQLK', 1, 'Большаков Давид Тихонович', '784567890123', NULL, '', '1980-08-22', 'паспорт РФ, 4511 234567, выдан ОУФМС России по г. Санкт-Петербургу, 22.08.2017, код подразделения 780-002', '', '', '191186, г. Санкт-Петербург, Невский проспект, д. 28, кв. 17', '321/456', '2025-01-01', '2025-12-31', '+7(917)532-45-12', '', 'ПАО «АК БАРС» БАНК', '1653008912', '049205805', '30101810000000000805', '40702810680060657001', 0, 15, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'User123'),
(3, 0, 'IvanovI', 'ivanov@mail.ru', '$2y$12$HDIEosUG4Kxs9tKZryjBTuL66YRrJzSBSl3vRIyw9rPfgT6v3x/W2', 1, 'Иванов Иван Сергеевич', '163456789012', NULL, '', '1978-12-05', 'паспорт РФ, 4512 345678, выдан ОУФМС России по Республике Татарстан, 05.12.2016, код подразделения 160-003', '', '', '420111, г. Казань, ул. Баумана, д. 7, кв. 89', '789/123', '2025-03-15', '2026-03-15', '+7(987)654-32-10', '', 'ПАО Сбербанк', '7707083893', '044525225', '30101810400000000225', '40817810700012345678', 0, 0, 0, 1, NULL, 1, 1, '2025-08-23 16:28:42', 'IvanovI123'),
(4, 0, 'PetrovaM', 'petrova@yandex.ru', '$2y$12$Iy8fnswQMh.eNBd9OSSTd.1z/dHvPTBlYT0hhpRwtzvSrb7lLfnqe', 1, 'Петрова Мария Владимировна', '547890123456', NULL, '', '1982-04-18', 'паспорт РФ, 4513 456789, выдан ОУФМС России по Новосибирской области, 18.04.2018, код подразделения 540-004', '', '', '630099, г. Новосибирск, Красный проспект, д. 33, кв. 5', '456/789', '2025-02-01', '2026-02-01', '+7(917)123-45-67', '', 'ВТБ (ПАО)', '7736210670', '044525187', '30101810700000000187', '40701810000001122334', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'PetrovaM123'),
(5, 0, 'SidorovA', 'sidorov@gmail.com', '$2y$12$mYbVBKkoadAn0mXfTafDvO3vH1cJ5QkS4WTysFIe1r1o7BtXlzxU2', 1, 'Сидоров Алексей Петрович', '662345678901', NULL, '', '1976-11-30', 'паспорт РФ, 4514 567890, выдан ОУФМС России по Свердловской области, 30.11.2014, код подразделения 660-005', '', '', '620014, г. Екатеринбург, ул. Ленина, д. 52, кв. 13', '987/654', '2025-05-10', '2026-05-10', '+7(927)987-65-43', '', 'АО «Райффайзенбанк»', '7744000302', '044525700', '30101810200000000700', '40817810500009876543', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'SidorovA123'),
(6, 0, 'KuznetsovaE', 'kuznetsova@mail.ru', '$2y$12$vba5ei1yvH.WHG49XCyJHOa6xMCouYAGAlst/ja2JqevPq1CQpsiC', 1, 'Кузнецова Елена Дмитриевна', '526789012345', NULL, '', '1983-07-12', 'паспорт РФ, 4515 678901, выдан ОУФМС России по Нижегородской области, 12.07.2019, код подразделения 520-006', '', '', '603005, г. Нижний Новгород, ул. Большая Покровская, д. 18, кв. 23', '654/321', '2025-04-20', '2026-04-20', '+7(917)555-44-33', '', 'ПАО «Промсвязьбанк»', '7744000912', '044525555', '30101810400000000555', '40701810600001112222', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'KuznetsovaE123'),
(7, 0, 'FedorovD', 'fedorov@yandex.ru', '$2y$12$wTEhIVnvnL.G3jd3iI7FOOymDgSXRI2wthm3e7VbqnOQkn5bk6OpS', 1, 'Федоров Дмитрий Николаевич', '631234567890', NULL, '', '1979-02-25', 'паспорт РФ, 4516 789012, выдан ОУФМС России по Самарской области, 25.02.2015, код подразделения 630-007', '', '', '443099, г. Самара, ул. Куйбышева, д. 91, кв. 12', '222/333', '2025-01-05', '2026-01-05', '+7(927)111-22-33', '', 'АО «Тинькофф Банк»', '7710140679', '044525974', '30101810145250000974', '40817810700003334455', 0, 0, 0, 1, NULL, 1, 1, '2025-08-23 16:28:41', 'FedorovD123'),
(8, 0, 'SmirnovaO', 'smirnova@gmail.com', '$2y$12$hYduWC9oH66AgYuipjnjxeuXpjsSsHDwI/jC0MUuhXtd7tZ6KmES6', 1, 'Смирнова Ольга Васильевнай', '615678901234', NULL, '', '1981-09-08', 'паспорт РФ, 4517 890123, выдан ОУФМС России по Ростовской области, 08.09.2016, код подразделения 610-008', '', '', '344006, г. Ростов-на-Дону, ул. Большая Садовая, д. 47, кв. 8', '555/666', '2024-12-12', '2025-12-12', '+7(917)999-88-77', '', 'ПАО «МОСКОВСКИЙ КРЕДИТНЫЙ БАНК»', '7744001889', '044525092', '30101810300000000092', '40701810200005556677', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'SmirnovaO123'),
(9, 0, 'NikolaevA', 'nikolaev@mail.ru', '$2y$12$bgdN3hRObmc.AJ0gKrQVVexl7ViMlVA121Usq3iFvsB2z9dARyvnO', 1, 'Николаев Артем Игоревич', '023456789012', NULL, '', '1977-06-20', 'паспорт РФ, 4518 901234, выдан ОУФМС России по Республике Башкортостан, 20.06.2017, код подразделения 020-009', '', '', '450008, г. Уфа, проспект Октября, д. 65, кв. 34', '777/888', '2025-03-03', '2026-03-03', '+7(927)333-44-55', '', 'ПАО «РОСБАНК»', '7736555141', '044525256', '30101810000000000256', '40702810400007778899', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:43', 'NikolaevA123'),
(10, 0, 'VolkovaA', 'volkova@yandex.ru', '$2y$12$vN7zWWVC0QNVsQqgB3ZGZ.iD7NcnPLALVN98Hx1bo6oWv92TOcxVy', 1, 'Волкова Анна Михайловна', '248901234567', NULL, '', '1984-01-14', 'паспорт РФ, 4519 012345, выдан ОУФМС России по Красноярскому краю, 14.01.2018, код подразделения 240-010', '', '', '660049, г. Красноярск, ул. Карла Маркса, д. 123, кв. 45', '999/000', '2025-06-25', '2026-06-25', '+7(917)777-66-55', '', 'ПАО «Совкомбанк»', '7707083893', '044525341', '30101810400000000341', '40701810500009990000', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:44', 'VolkovaA123'),
(11, 0, 'FazullinMI', 'marych@mail.com', '$2y$12$lxuL.G4oDF/vn1xTYPKE9OBrVKspV4PQ.PO3.TmNkRUbuVRwDkiIi', 1, 'Фазуллин Марат Ильевич', '236789012345', NULL, '', '1975-10-03', 'паспорт РФ, 4520 123456, выдан ОУФМС России по Краснодарскому краю, 03.10.2015, код подразделения 230-011', '', '', '350000, г. Краснодар, ул. Красная, д. 156, кв. 33', '452/6565', '2025-01-01', '2025-12-31', '+79578545', '', 'Отдел N 14 УФК по Краснодарскому краю', '2308005913', '000396186', '40116810903960010002', '40012320001212016952', 0, 0, 0, 0, NULL, 1, 1, '2025-08-23 16:28:40', 'FazullinMI123'),
(12, 0, 'IPPetrovMSK', 'petrov.ip@mail.ru', '$2y$12$0RL8olKUpGc5TuMy07T05uyh5nYz.X8m0qpz/mtG.Jsykx8aXlfs6', 1, 'Петров Михаил Сергеевич (ИП)', '771234567890', NULL, '', '1980-05-15', 'паспорт РФ, 4510 123456, выдан ОУФМС России по г. Москве, 15.05.2015, код подразделения 770-001', '', '3217700001234', 'г. Москва, ул. Тверская, д. 25, оф. 15', 'ДГ-001/2024', '2024-01-15', '2025-01-15', '+7(495)123-45-67', 'УСН', 'ПАО Сбербанк', '7707083893', '044525225', '30101810400000000225', '40802810100001234567', 1, 10, 1, 0, NULL, 2, 1, '2025-08-23 16:28:42', 'IPPetrovMSK123'),
(13, 0, 'IPSidorovaSPB', 'sidorova.ip@gmail.com', '$2y$12$/2qymnMg4ppgKgM1Qh4uheldF2Msv3TU9v5haX1fHFf6s2F93MPHa', 1, 'Сидорова Елена Владимировна (ИП)', '784567890123', NULL, '', '1985-08-20', 'паспорт РФ, 4511 234567, выдан ОУФМС России по г. Санкт-Петербургу, 20.08.2017, код подразделения 780-002', '', '3217800002345', 'г. Санкт-Петербург, Невский пр-т, д. 100, оф. 8', 'ДГ-002/2024', '2024-02-01', '2025-02-01', '+7(812)234-56-78', 'УСН', 'ВТБ (ПАО)', '7736210670', '044525187', '30101810700000000187', '40802810200002345678', 1, 12, 1, 0, NULL, 2, 1, '2025-08-23 16:28:42', 'IPSidorovaSPB123'),
(14, 0, 'IPIvanovKZN', 'ivanov.ip@yandex.ru', '$2y$12$z86UmHA/EXIjVDxZ7UcwFOMA3SWoj6l0.trsxR1F8teUsfTsPFIkC', 1, 'Иванов Алексей Петрович (ИП)', '163456789012', NULL, '', '1978-12-10', 'паспорт РФ, 4512 345678, выдан ОУФМС России по Республике Татарстан, 10.12.2016, код подразделения 160-003', '', '3211600003456', 'г. Казань, ул. Баумана, д. 50, оф. 3', 'ДГ-003/2024', '2024-03-10', '2025-03-10', '+7(843)345-67-89', 'Патент', 'ПАО «АК БАРС» БАНК', '1653008912', '049205805', '30101810000000000805', '40802810300003456789', 1, 8, 0, 0, NULL, 2, 1, '2025-08-23 16:28:41', 'IPIvanovKZN123'),
(15, 0, 'IPKuznetsovaEKB', 'kuznetsova.ip@mail.com', '$2y$12$PBaIjykYO.22TYvpiyqOWOFzvmFaAciuD0yufQCO5qtatxi5zvWSe', 1, 'Кузнецова Ольга Дмитриевна (ИП)', '662345678901', NULL, '', '1983-03-25', 'паспорт РФ, 4513 456789, выдан ОУФМС России по Свердловской области, 25.03.2018, код подразделения 660-004', '', '3216600004567', 'г. Екатеринбург, ул. Ленина, д. 33, оф. 12', 'ДГ-004/2024', '2024-04-05', '2025-04-05', '+7(343)456-78-90', 'УСН', 'АО «Райффайзенбанк»', '7744000302', '044525700', '30101810200000000700', '40802810400004567890', 1, 15, 1, 0, NULL, 2, 1, '2025-08-23 16:28:41', 'IPKuznetsovaEKB123'),
(16, 0, 'IPFedorovNVS', 'fedorov.ip@gmail.com', '$2y$12$eqOddQYsocxQZBpJFypxZ.AoBmvJ.e5RQpxQsQZ1JFvAfF9YvAXf.', 1, 'Федоров Дмитрий Николаевич (ИП)', '547890123456', NULL, '', '1979-07-18', 'паспорт РФ, 4514 567890, выдан ОУФМС России по Новосибирской области, 18.07.2019, код подразделения 540-005', '', '3215400005678', 'г. Новосибирск, Красный пр-т, д. 77, оф. 7', 'ДГ-005/2024', '2024-05-12', '2025-05-12', '+7(383)567-89-01', 'УСН', 'ПАО «Совкомбанк»', '5250006086', '044525341', '30101810400000000341', '40802810500005678901', 1, 11, 1, 0, NULL, 2, 1, '2025-08-23 16:28:41', 'IPFedorovNVS123'),
(17, 0, 'IPSmirnovaNN', 'smirnova.ip@yandex.ru', '$2y$12$oJgS55soR1zE/eIusHNwS.R.Yi5.ot2q/PGHEzDIQlHAKqZIVGJuC', 1, 'Смирнова Анна Васильевна (ИП)', '526789012345', NULL, '', '1982-11-30', 'паспорт РФ, 4515 678901, выдан ОУФМС России по Нижегородской области, 30.11.2020, код подразделения 520-006', '', '3215200006789', 'г. Нижний Новгород, ул. Большая Покровская, д. 45, оф. 5', 'ДГ-006/2024', '2024-06-20', '2025-06-20', '+7(831)678-90-12', 'Патент', 'ПАО «Промсвязьбанк»', '7744001497', '044525555', '30101810400000000555', '40802810600006789012', 1, 9, 0, 0, NULL, 2, 1, '2025-08-23 16:28:42', 'IPSmirnovaNN123'),
(18, 0, 'IPNikolaevSAM', 'nikolaev.ip@mail.ru', '$2y$12$YwWbrsh1AnorxLG8DZKwUuipO1rGuMtFNYY0d5FFNEetjIyRYmWGG', 1, 'Николаев Артем Игоревич (ИП)', '631234567890', NULL, '', '1981-04-14', 'паспорт РФ, 4516 789012, выдан ОУФМС России по Самарской области, 14.04.2021, код подразделения 630-007', '', '3216300007890', 'г. Самара, ул. Куйбышева, д. 120, оф. 10', 'ДГ-007/2024', '2024-07-08', '2025-07-08', '+7(846)789-01-23', 'УСН', 'АО «Тинькофф Банк»', '7710140679', '044525974', '30101810145250000974', '40802810700007890123', 1, 13, 1, 0, NULL, 2, 1, '2025-08-23 16:28:42', 'IPNikolaevSAM123'),
(19, 0, 'IPVolkovRND', 'volkov.ip@gmail.com', '$2y$12$WtEfV6jvMiwfqY26H2a49uEo4uaBqrUhKR8OAkMtl11cEL56hoMZC', 1, 'Волков Сергей Михайлович (ИП)', '615678901234', NULL, '', '1984-09-22', 'паспорт РФ, 4517 890123, выдан ОУФМС России по Ростовской области, 22.09.2022, код подразделения 610-008', '', '3216100008901', 'г. Ростов-на-Дону, ул. Большая Садовая, д. 88, оф. 4', 'ДГ-008/2024', '2024-08-15', '2025-08-15', '+7(863)890-12-34', 'УСН', 'ПАО «РОСБАНК»', '7736555141', '044525256', '30101810000000000256', '40802810800008901234', 1, 14, 1, 0, NULL, 2, 1, '2025-08-23 16:28:42', 'IPVolkovRND123'),
(20, 0, 'IPMorozovaKRD', 'morozova.ip@yandex.ru', '$2y$12$MVh4OTFdNBwK3lI090d5Nu0tWACw69AyThlGTWY3IobqLCpb8U.sK', 1, 'Морозова Ирина Александровна (ИП)', '236789012345', NULL, '', '1986-01-08', 'паспорт РФ, 4518 901234, выдан ОУФМС России по Краснодарскому краю, 08.01.2023, код подразделения 230-009', '', '3212300009012', 'г. Краснодар, ул. Красная, д. 150, оф. 6', 'ДГ-009/2024', '2024-09-01', '2025-09-01', '+7(861)901-23-45', 'Патент', 'ПАО «МОСКОВСКИЙ КРЕДИТНЫЙ БАНК»', '7744001889', '044525092', '30101810300000000092', '40802810900009012345', 1, 7, 0, 0, NULL, 2, 1, '2025-08-23 16:28:41', 'IPMorozovaKRD123'),
(21, 0, 'IPGabitovUFA', 'gabitov.ip@mail.ru', '$2y$12$wmThVE3SrTQMezR9PH41kuXOTb2kf9C6KiaFLg/jMdcbvfqh2S8Ke', 1, 'Габитов Руслан Фаритович (ИП)', '023456789012', NULL, '', '1987-06-17', 'паспорт РФ, 4519 012345, выдан ОУФМС России по Республике Башкортостан, 17.06.2023, код подразделения 020-010', '', '3210200000123', 'г. Уфа, пр-т Октября, д. 100, оф. 9', 'ДГ-010/2024', '2024-10-10', '2025-10-10', '+7(347)012-34-56', 'УСН', 'АКБ «Абсолют Банк» (ПАО)', '7729013549', '044525976', '30101810500000000976', '40802811000000123456', 1, 16, 1, 0, NULL, 2, 1, '2025-08-23 16:28:41', 'IPGabitovUFA123');

--
-- Триггеры `users`
--
DELIMITER $$
CREATE TRIGGER `set_privacy_consent_date` BEFORE UPDATE ON `users` FOR EACH ROW BEGIN
    IF NEW.privacy_consent = 1 THEN
        SET NEW.privacy_consent_date = CURRENT_TIMESTAMP;
    ELSEIF NEW.privacy_consent = 0 THEN
        SET NEW.privacy_consent_date = NULL;
    END IF;
END
$$
DELIMITER ;
DELIMITER $$
CREATE TRIGGER `set_privacy_consent_date_insert` BEFORE INSERT ON `users` FOR EACH ROW BEGIN
    IF NEW.privacy_consent = 1 THEN
        SET NEW.privacy_consent_date = CURRENT_TIMESTAMP;
    ELSEIF NEW.privacy_consent = 0 THEN
        SET NEW.privacy_consent_date = NULL;
    END IF;
END
$$
DELIMITER ;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `idx_users_login_pass` (`login`,`pass`) USING BTREE;

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
